Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord
Represents an DockPanePlugin record in Navisworks

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.AutoScroll
Determines if scroll bars should appear when the pane gets bellow it's minimum size

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.FixedSize
Determines if the pane should be resizable

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.MinimumHeight
Minimum height of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.MinimumWidth
Minimum width of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.PreferredHeight
Preferred height of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.PreferredWidth
Preferred width of pane, 0 means no preference

Autodesk.Navisworks.Api.Plugins.DockPanePluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load